export const keywordArr = ['고급스러운', '개구진', '굳센', '귀여운', '깨끗한', '깔끔한', '강렬한', '고요한', '건강한', '구조적인', '날카로운'
    , '대조적인', '딱딱한', '달콤한', '따뜻한', '다채로운', '단아한', '다정한', '단정한', '다부진', '로맨틱한', '러프한', '몽환적인', '맑은', '무게감있는', '명랑한', '모던한'
    , '매혹적인', '복잡한', '빈티지한', '부드러운', '밝은', '발랄한', '상냥한', '성숙한', '신비로운', '산뜻한', '심플한', '순수한', '사랑스러운', '스포티한', '선한', '시크한'
    , '신뢰감있는', '싱그러운', '수수한', '세련된', '상큼한', '시원한', '우아한', '이국적인', '유쾌한', '우디한', '잔잔한', '중후한', '전문적인', '중성의', '지적인', '짙은'
    , '자유분방한', '자연스러운', '조용한', '정열적인', '차가운', '총명한', '청량한', '차분한', '천진난만한', '청초한', '클래식한', '쾌활한', '캐쥬얼한', '투명한', '퇴폐적인'
    , '풍요로운', '편안한', '평화로운', '환한', '화사한', '화려한', '활기찬']


export const imageTagArr =
{
    "image0000.jpg": ["퇴폐적인", "무게감있는", "성숙한", "자유분방한", "매혹적인", "몽환적인"],
    "image0001.jpg": ["몽환적인", "신비로운", "중성의", "차가운", "짙은", "강렬한"],
    "image0002.jpg": ["깔끔한", "부드러운", "전문적인", "평화로운", "클래식한"],
    "image0003.jpg": ["차가운", "퇴폐적인", "짙은", "성숙한", "몽환적인", "매혹적인", "강렬한"],
    "image0004.jpg": ["자유분방한", "평화로운", "풍요로운"],
    "image0005.jpg": ["평화로운", "활기찬", "잔잔한", "풍요로운"],
    "image0006.jpg": ["퇴폐적인", "강렬한"],
    "image0007.jpg": ["부드러운", "캐쥬얼한", "밝은", "모던한", "화려한"],
    "image0008.jpg": ["심플한", "캐쥬얼한", "부드러운", "밝은", "모던한"],
    "image0009.jpg": ["깔끔한", "달콤한", "깨끗한", "구조적인", "사랑스러운", "밝은"],
    "image0010.jpg": ["따뜻한", "모던한", "단아한", "밝은", "구조적인", "부드러운"],
    "image0011.jpg": ["화려한", "다채로운", "편안한", "깔끔한", "부드러운", "구조적인", "밝은", "모던한"],
    "image0012.jpg": ["세련된"],
    "image0013.jpg": ["깔끔한", "단아한", "우디한", "모던한", "심플한", "깨끗한", "밝은", "환한", "편안한", "캐쥬얼한", "조용한"],
    'image0014.jpg': ['따뜻한', '부드러운', '우디한', '잔잔한', '조용한', '차분한'],
    'image0015.jpg': ['귀여운', '다정한', '사랑스러운', '천진난만한', '평화로운'],
    'image0016.jpg': ['빈티지한', '캐쥬얼한', '따뜻한', '러프한'],
    'image0017.jpg': ['스포티한', '클래식한', '고급스러운', '부드러운', '빈티지한'],
    'image0018.jpg': ['귀여운', '개구진', '다채로운', '명랑한', '발랄한', '천진난만한', '쾌활한', '화려한', '활기찬'],
    'image0019.jpg': ['빈티지한', '밝은', '캐쥬얼한', '청량한', '발랄한'],
    'image0020.jpg': ['이국적인', '환한', '우디한', '캐쥬얼한', '우아한', '깔끔한', '세련된', '모던한', '고급스러운', '밝은'],
    'image0021.jpg': ['중후한', '짙은', '차가운', '강렬한', '무게감있는', '대조적인', '모던한'],
    'image0022.jpg': ['대조적인', '부드러운', '고요한', '잔잔한', '짙은', '조용한'],
    'image0023.jpg': ['순수한', '사랑스러운', '천진난만한', '선한', '평화로운', '개구진', '귀여운', '발랄한'],
    'image0024.jpg': ['평화로운', '자연스러운', '고요한', '따뜻한', '신비로운'],
    'image0025.jpg': ['따뜻한', '부드러운'],
    'image0026.jpg': ['귀여운', '모던한', '빈티지한'],
    'image0027.jpg': ['이국적인', '고요한', '따뜻한', '청량한', '맑은', '평화로운', '밝은', '환한', '산뜻한'],
    'image0028.jpg': ['고급스러운', '클래식한', '화려한', '모던한'],
    'image0029.jpg': ['부드러운', '빈티지한', '우디한'],
    'image0030.jpg': ['매혹적인', '풍요로운', '우아한', '따뜻한', '밝은', '화사한', '로맨틱한'],
    'image0031.jpg': ['잔잔한', '환한', '시원한'],
    'image0032.jpg': ['구조적인', '깔끔한', '정열적인', '강렬한', '전문적인', '스포티한', '무게감있는', '짙은', '고급스러운', '매혹적인'],
    'image0033.jpg': ['개구진', '귀여운', '명랑한', '유쾌한', '천진난만한'],
    'image0034.jpg': ['러프한', '평화로운', '차분한', '잔잔한', '스포티한'],
    'image0035.jpg': ['몽환적인', '화사한', '밝은', '풍요로운', '화사한', '중성의'],
    'image0036.jpg': ['고요한', '따뜻한', '화사한', '이국적인'],
    'image0037.jpg': ['차가운', '잔잔한', '차분한', '복잡한', '짙은'],
    'image0038.jpg': ['퇴폐적인', '정열적인', '화려한', '몽환적인', '매혹적인', '다채로운', '강렬한'],
    'image0039.jpg': ['퇴폐적인', '고급스러운', '화려한', '성숙한', '몽환적인', '신비로운', '매혹적인', '강렬한'],
    'image0040.jpg': ['강렬한', '성숙한', '다채로운', '신비로운', '몽환적인', '화려한', '매혹적인'],
    'image0041.jpg': ['이국적인', '고요한', '빈티지한', '자연스러운'],
    'image0042.jpg': ['차분한', '조용한', '이국적인', '고요한', '잔잔한'],
    'image0043.jpg': ['이국적인', '우디한', '자연주의', '조용한'],
    'image0044.jpg': ['러프한', '잔잔한', '짙은', '차가운', '차분한'],
    'image0045.jpg': ['구조적인', '고급스러운', '모던한', '대조적인', '세련된', '복잡한'],
    'image0046.jpg': ['딱딱한', '고급스러운', '모던한', '딱딱한', '구조적인', '대조적인', '복잡한', '화려한'],
    'image0047.jpg': ['빈티지한', '편안한', '차분한', '평화로운'],
    'image0048.jpg': ['산뜻한', '싱그러운', '수수한', '청초한'],
    'image0049.jpg': ['구조적인', '짙은', '복잡한', '차가운', '딱딱한', '무게감있는', '중후한'],
    'image0050.jpg': ['강렬한', '몽환적인', '강렬한'],
    'image0051.jpg': ['로맨틱한', '이국적인', '풍요로운', '환한', '화려한'],
    'image0052.jpg': ['맑은', '시원한', '산뜻한'],
    'image0053.jpg': ['깔끔한', '모던한', '심플한', '전문적인'],
    'image0054.jpg': ['활기찬', '러프한'],
    'image0055.jpg': ['빈티지한', '부드러운', '짙은', '조용한', '평화로운'],
    'image0056.jpg': ['고요한', '차분한', '화려한', '환한'],
    'image0057.jpg': ['부드러운', '짙은', '구조적인', '중후한', '클래식한', '단아한', '신비로운'],
    'image0058.jpg': ['활기찬', '빈티지한', '러프한', '강렬한', '자유분방한', '다채로운', '복잡한', '대조적인', '화려한', '퇴폐적인'],
    'image0059.jpg': ['몽환적인', '맑은', '환한', '싱그러운', '평화로운'],
    'image0060.jpg': ['평화로운', '풍요로운', '고요한', '신비로운'],
    'image0061.jpg': ['몽환적인', '강렬한', '화려한', '대조적인'],
    'image0062.jpg': ['환한', '따뜻한', '밝은', '깨끗한', '평화로운'],
    'image0063.jpg': ['이국적인', '환한', '심플한'],
    'image0064.jpg': ['고급스러운', '산뜻한', '풍요로운', '로맨틱한'],
    'image0065.jpg': ['이국적인', '짙은', '고요한'],
    'image0066.jpg': ['빈티지한', '딱딱한', '러프한', '클래식한'],
    'image0067.jpg': ['성숙한', '무게감있는', '굳센', '다부진', '성숙한', '굳센', '시크한', '강렬한', '중후한', '러프한', '짙은'],
    'image0068.jpg': ['화려한', '고급스러운', '모던한', '다채로운'],
    'image0069.jpg': ['환한', '구조적인', '투명한', '모던한', '청량한', '심플한', '시원한', '깔끔한'],
    'image0070.jpg': ['몽환적인', '부드러운', '대조적인', '자유분방한', '활기찬', '다채로운', '러프한'],
    'image0071.jpg': ['사랑스러운', '로맨틱한', '밝은', '산뜻한', '부드러운'],
    'image0072.jpg': ['조용한', '차가운', '러프한', '차가운'],
    'image0073.jpg': ['몽환적인', '신비로운'],
    'image0074.jpg': ['쾌활한', '발랄한', '유쾌한', '명랑한', '천진난만한'],
    'image0075.jpg': ['빈티지한', '퇴폐적인', '러프한', '짙은', '무게감있는', '몽환적인', '성숙한', '시크한'],
    'image0076.jpg': ['우디한', '전문적인', '지적인', '클래식한'],
    'image0077.jpg': ['달콤한', '산뜻한', '발랄한', '상큼한', '화사한'],
    'image0078.jpg': ['무게감있는', '차가운', '복잡한', '날카로운', '딱딱한', '깔끔한'],
    'image0079.jpg': ['딱딱한', '모던한', '화사한', '캐쥬얼한', '따뜻한', '활기찬', '밝은', '산뜻한'],
    'image0080.jpg': ['짙은', '몽환적인', '차가운', '퇴폐적인', '중성의', '무게감있는', '성숙한'],
    'image0081.jpg': ['클래식한', '이국적인', '우디한', '다채로운', '고급스러운', '화려한', '풍요로운', '우아한'],
    'image0082.jpg': ['따뜻한', '성숙한', '청초한', '수수한'],
    'image0083.jpg': ['우디한', '자연스러운'],
    'image0084.jpg': ['귀여운', '싱그러운', '단정한', '천진난만한', '밝은', '쾌활한', '발랄한', '상냥한', '순수한'],
    'image0085.jpg': ['빈티지한', '몽환적인'],
    'image0086.jpg': ['따뜻한', '환한', '조용한'],
    'image0087.jpg': ['성숙한', '중성의', '수수한', '중성의', '몽환적인', '매혹적인'],
    'image0088.jpg': ['산뜻한', '평화로운', '화사한', '환한', '잔잔한', '상큼한'],
    'image0089.jpg': ['부드러운', '자유분방한'],
    'image0090.jpg': ['로맨틱한', '화사한', '청초한', '단아한'],
    'image0091.jpg': ['청초한', '수수한', '단아한'],
    'image0092.jpg': ['성숙한', '몽환적인', '매혹적인', '신비로운', '우아한'],
    'image0093.jpg': ['성숙한', '퇴폐적인', '매혹적인', '신비로운', '몽환적인'],
    'image0094.jpg': ['싱그러운', '시원한', '건강한', '청량한'],
    'image0095.jpg': ['캐쥬얼한', '차가운', '시원한'],
    'image0096.jpg': ['몽환적인', '차분한', '고요한', '잔잔한', '평화로운'],
    'image0097.jpg': ['사랑스러운', '로맨틱한', '상냥한', '달콤한'],
    'image0098.jpg': ['맑은', '신비로운', '빈티지한', '투명한', '몽환적인'],
    'image0099.jpg': ['고요한', '투명한', '차분한', '부드러운'],
    'image0100.jpg': ['청량한', '맑은', '싱그러운'],
    "image0101.jpg": ['맑은', '부드러운', '조용한', '평화로운', '차가운', '투명한', '고요한'],
    "image0102.jpg": ['부드러운', '빈티지한', '이국적인', '클래식한'],
    "image0103.jpg": ['차가운', '조용한', '모던한', '무게감있는'],
    "image0104.jpg": ['대조적인', '딱딱한', '무게감있는', '클래식한', '잔잔한', '중후한'],
    "image0105.jpg": ['활기찬', '쾌활한', '강렬한', '복잡한', '정열적인', '자유분방한'],
    "image0106.jpg": ['사랑스러운', '유쾌한', '시크한', '성숙한'],
    "image0107.jpg": ['사랑스러운', '화사한', '다정한', '우아한'],
    "image0108.jpg": ['대조적인', '정열적인', '화려한', '이국적인', '정열적인', '무게감있는', '퇴폐적인'],
    "image0109.jpg": ['싱그러운', '수수한', '환한', '차분한'],
    "image0110.jpg": ['러프한', '퇴폐적인', '자유분방한'],
    "image0111.jpg": ['스포티한', '신뢰감있는', '무게감있는', '짙은', '고급스러운', '다부진', '시크한'],
    "image0112.jpg": ['고급스러운', '심플한', '단정한', '모던한', '세련된'],
    "image0113.jpg": ['신비로운', '다채로운', '평화로운'],
    'image0114.jpg': ['개구진', '귀여운', '발랄한', '자연주의', '순수한', '사랑스러운'],
    'image0115.jpg': ['잔잔한', '고요한'],
    'image0116.jpg': ['신비로운', '몽환적인', '이국적인', '우디한', '고요한'],
    'image0117.jpg': ['캐쥬얼한', '러프한', '자유분방한', '자연스러운', '러프한', '시크한', '스포티한'],
    'image0118.jpg': ['스포티한', '굳센', '건강한', '다부진', '전문적인'],
    'image0119.jpg': ['모던한', '다채로운', '캐쥬얼한', '밝은', '대조적인'],
    'image0120.jpg': ['천진난만한', '사랑스러운', '명랑한', '다정한', '신뢰감있는', '편안한', '따뜻한', '밝은', '순수한', '귀여운', '상냥한'],
    'image0121.jpg': ['러프한', '신비로운', '다채로운', '부드러운', '달콤한'],
    'image0122.jpg': ['구조적인', '차가운', '시원한', '잔잔한', '청량한'],
    'image0123.jpg': ['다채로운', '구조적인', '따뜻한', '산뜻한', '캐쥬얼한'],
    'image0124.jpg': ['차가운', '지적인', '전문적인', '무게감있는', '신뢰감있는', '풍요로운'],
    'image0125.jpg': ['자유분방한', '구조적인', '모던한', '활기찬', '무게감있는', '차가운', '대조적인'],
    'image0126.jpg': ['고급스러운', '모던한', '단정한', '세련된', '깔끔한'],
    'image0127.jpg': ['전문적인', '신뢰감있는', '총명한'],
    'image0128.jpg': ['자연주의', '빈티지한', '밝은', '따뜻한', '평화로운'],
    'image0129.jpg': ['싱그러운', '빈티지한', '로맨틱한'],
    'image0130.jpg': ['매혹적인', '조용한', '고요한', '짙은', '무게감있는', '정열적인'],
    'image0131.jpg': ['따뜻한', '다정한', '선한', '유쾌한', '자유분방한', '밝은', '명랑한', '편안한'],
    'image0132.jpg': ['다정한', '쾌활한', '명랑한', '상냥한', '밝은'],
    'image0133.jpg': ['스포티한', '건강한', '활기찬'],
    'image0134.jpg': ['전문적인', '지적인', '클래식한', '신뢰감있는', '전문적인'],
    'image0135.jpg': ['구조적인', '깔끔한'],
    'image0136.jpg': ['정열적인', '활기찬', '자유분방한', '캐쥬얼한'],
    'image0137.jpg': ['활기찬', '자유분방한', '쾌활한']
}

export const imageInfo = importAllImage(require.context(process.env.PUBLIC_URL + '../asset', false, /\.(png|jpe?g|svg)$/))

function importAllImage(r) {
    let images = {};
    r.keys().map((item, index) => {
        images[item.replace('./', '')] = { "path": r(item), "isSelected": false, "tag": imageTagArr[item.replace('./', '')] }
    });
    return images;
}

export const keywordInfo = importAllKeyword()

function importAllKeyword() {
    let keywords = {};
    keywordArr.map((keyword, index) => {
        keywords[keyword] = { "name": keyword, "isSelected": false }
    })
    return keywords;
}

export const fontInfo = {
1:{'name':'Josefin Sans','weight':300,'tag':
[]
},
2:{'name':'Karla','weight':400,'tag':['귀여운','깔끔한','단정한','명랑한','딱딱한','심플한','스포티한','캐쥬얼한','모던한']},
3:{'name':'Dosis','weight':400,'tag':['자유분방한','캐쥬얼한','환한','액티브한(활기찬)','건강한','따뜻한','다정한','귀여운','발랄한','순수한','선한','명랑한']},
4:{'name':'Bitter','weight':400,'tag':['자연주의','청초한','클래식한','평화로운','다채로운','고요한','따뜻한','편안한','다정한','로맨틱한','성숙한','부드러운','세련된','수수한','싱그러운','풍요로운','선한']},
5:{'name':'Comfortaa','weight':700,'tag':['귀여운','시원한','단정한','개구진','깨끗한','깔끔한','건강한','명랑한','액티브한(활기찬)','모던한','발랄한','부드러운','밝은','산뜻한','심플한','순수한','사랑스러운','싱그러운','상큼한','유쾌한','자유분방한','천진난만한','쾌활한','화사한','캐쥬얼한']},
6:{'name':'Exo 2','weight':700,'tag':['쾌활한','퇴폐적인','캐쥬얼한','액티브한(활기찬)','자유분방한','중성의','시원한','복잡한','대조적인','스포티한','굳센','강렬한']},
7:{'name':'Exo 2','weight':200,'tag':['개구진','구조적인','건강한','날카로운','다부진','딱딱한','러프한','모던한','복잡한','심플한','스포티한','우디한','중성의','캐쥬얼한','차가운']},
8:{'name':'Caveat','weight':600,'tag':['유쾌한','이국적인','스포티한','액티브한(활기찬)','러프한','우디한','자연주의','자유분방한','빈티지한','부드러운','쾌활한','발랄한','캐쥬얼한']},
9:{'name':'Archivo Narrow','weight':700,'tag':['건강한','대조적인','딱딱한','다부진','구조적인','강렬한','굳센','날카로운','무게감있는','모던한','심플한','시원한','스포티한','시크한','신뢰감있는','짙은','차가운','캐쥬얼한','액티브한(활기찬)']},
10:{'name':'Changa','weight':400,'tag':['쾌활한','우디한','캐쥬얼한','유쾌한','구조적인','개구진','귀여운','발랄한','대조적인','명랑한','빈티지한','액티브한(활기찬)']},
11:{'name':'Orbitron','weight':400,'tag':['정열적인','다부진','시원한','신뢰감있는','시크한','전문적인','차가운','구조적인','건강한','강렬한','총명한','차가운','전문적인','스포티한']},
12:{'name':'Lexend Deca','weight':100,'tag':['깨끗한','깔끔한','고급스러운','딱딱한','단정한','모던한','맑은','밝은','상냥한','선한','세련된','싱그러운','중성의','잔잔한','조용한','차분한','총명한','청초한','투명한','편안한']},
13:{'name':'Lexend Deca','weight':400,'tag':['스포티한','시원한','건강한','신뢰감있는','심플한','신뢰감있는','우디한','차가운','짙은','캐쥬얼한']},
14:{'name':'Caveat','weight':600,'tag':
[]
},
15:{'name':'Josefin Sans','weight':500,'tag':['시원한','캐쥬얼한','쾌활한','구조적인','모던한','세련된','심플한','딱딱한','대조적인','발랄한','복잡한']},
16:{'name':'Staatliches','weight':400,'tag':['굳센','강렬한','건강한','구조적인','대조적인','딱딱한','다부진','무게감있는','심플한','스포티한','시크한','세련된','시원한','짙은','자유분방한','정열적인','중성의','차가운','총명한','캐쥬얼한','화려한']},
17:{'name':'Titan One','weight':400,'tag':['다채로운','개구진','귀여운','따뜻한','다정한','달콤한','러프한','명랑한','밝은','발랄한','부드러운','빈티지한','순수한','사랑스러운','유쾌한','자유분방한','천진난만한','쾌활한','화사한','환한']},
18:{'name':'Comfortaa','weight':400,'tag':['선한','환한','편안한','평화로운','투명한','조용한','자연주의','청초한','청량한','차분한','수수한','싱그러운','상큼한','사랑스러운','산뜻한','심플한','상냥한','로맨틱한','다정한','귀여운','깨끗한','깔끔한']},


21:{'name':'Belleza','weight':400,'tag':['고급스러운','전문적인','이국적인','선한','우아한','지적인','잔잔한','단아한','따뜻한','세련된','수수한','조용한','풍요로운','신뢰감있는','청초한','차분한','무게감있는','단아한','평화로운','편안한','고요한']},
22:{'name':'Capriola','weight':400,'tag':['쾌활한','화사한','상큼한','밝은','상냥한','천진난만한','발랄한','순수한','산뜻한','사랑스러운','로맨틱한','달콤한','명랑한','부드러운','다정한','귀여운','깔끔한','다채로운','개구진','따뜻한']},
23:{'name':'Stick No Bills','weight':400,'tag':['짙은','정열적인','차가운','빈티지한','복잡한','우디한','중성의','깨끗한','구조적인','다채로운','대조적인','딱딱한','다부진','러프한']},
24:{'name':'Syncopate','weight':400,'tag':['건강한','굳센','강렬한','구조적인','전문적인','다부진','대조적인','딱딱한','복잡한','몽환적인','스포티한','짙은','중성의','캐쥬얼한']},
25:{'name':'Six Caps','weight':400,'tag':['대조적인','딱딱한','퇴폐적인','날카로운','강렬한','다부진','러프한','복잡한','시크한','차가운']},
26:{'name':'El Messiri','weight':400,'tag':['클래식한','풍요로운','화려한','고급스러운','지적인','로맨틱한','부드러운','모던한','매혹적인','세련된','신뢰감있는','모던한','몽환적인','신비로운','성숙한']},
27:{'name':'Arvo','weight':400,'tag':['풍요로운','클래식한','이국적인','총명한','클래식한','신뢰감있는','성숙한','전문적인','지적인','딱딱한']},
28:{'name':'Lateef','weight':400,'tag':['복잡한','날카로운','깨끗한','딱딱한','시크한','전문적인','중후한','짙은','차가운','총명한']},
29:{'name':'Halant','weight':400,'tag':['신뢰감있는','풍요로운','편안한','조용한','차분한','잔잔한','성숙한','날카로운','단정한','고급스러운','단아한','모던한','클래식한','총명한']},
30:{'name':'Lustria','weight':400,'tag':['풍요로운','편안한','평화로운','환한','차분한','잔잔한','조용한','성숙한','신뢰감있는','부드러운','단정한','고급스러운','깔끔한','고요한','단아한','모던한','클래식한']},
31:{'name':'Cinzel Decorative','weight':400,'tag':['빈티지한','자유분방한','잔잔한','중후한','클래식한','풍요로운','화려한','매혹적인','몽환적인','신비로운','다채로운','따뜻한','로맨틱한','우디한','우아한','이국적인']},
32:{'name':'Judson','weight':400,'tag':
[]
},
33:{'name':'Alfa Slab One','weight':400,'tag':
[]
},
34:{'name':'Cutive Mono','weight':400,'tag':['맑은','평화로운','클래식한','청량한','단정한','수수한','상냥한','조용한','깔끔한','건강한','깨끗한']},
35:{'name':'Josefin Slab','weight':400,'tag':['투명한','청량한','차분한','총명한','차가운','사랑스러운','신비로운','편안한','평화로운','단아한','깨끗한','깔끔한','고요한','단정한','맑은','몽환적인','모던한','부드러운','성숙한']},
36:{'name':'Philosopher','weight':400,'tag':['클래식한','평화로운','풍요로운','전문적인','잔잔한','지적인','차분한','고급스러운','고요한','우아한','로맨틱한','무게감있는','성숙한','신비로운','신뢰감있는','선한','세련된','화사한']},
37:{'name':'Shadows Into Light','weight':400,'tag':['정열적인','평화로운','자연주의','자유분방한','총명한','깨끗한','건강한','다채로운','러프한','빈티지한','발랄한','신뢰감있는','수수한','우디한']},
38:{'name':'Norican','weight':400,'tag':['자연주의','강렬한','건강한','다채로운','러프한','명랑한','복잡한','발랄한','자유분방한','스포티한','유쾌한','정열적인','쾌활한','캐쥬얼한']},
39:{'name':'Permanent Marker','weight':400,'tag':['강렬한','건강한','굳센','자유분방한','다부진','러프한','빈티지한','스포티한','우디한','짙은','자연주의','정열적인','퇴폐적인','풍요로운']},
40:{'name':'Chewy','weight':400,'tag':['캐쥬얼한','자연주의','쾌활한','환한','화사한','상큼한','순수한','유쾌한','자유분방한','밝은','발랄한','명랑한','부드러운','개구진','달콤한','다정한','귀여운']},
41:{'name':'Amatic SC','weight':400,'tag':['청초한','청량한','차분한','투명한','평화로운','깨끗한','개구진','귀여운','깔끔한','따뜻한','건강한','고요한','산뜻한','심플한','순수한','잔잔한','자연주의','조용한','환한']},
42:{'name':'Oleo Script','weight':400,'tag':['개구진','굳센','성숙한','다부진','빈티지한','부드러운','짙은','복잡한','명랑한','발랄한','시원한','이국적인','자유분방한','캐쥬얼한','풍요로운']},
};


export const colorInfo = {
    1: {
        "hex": ['#F98866', '#80BD9E', '#FF420E', '#89DA59'],
        "tag": ['청량한', '청초한', '천진난만한', '쾌활한', '화사한', '다채로운', '로맨틱한', '명랑한', '발랄한', '산뜻한', '싱그러운', '개구진']
    },
    2: {
        "hex": ['#763626', '#2A3132', '#336B87', '#90AFC5'],
        "tag": ['러프한', '고급스러운', '다부진', '중후한', '무게감있는', '신뢰감있는', '지적인', '총명한', '전문적인', '차분한', '짙은', '잔잔한', '날카로운  ']
    },
    3: {
        "hex": ['#BA5536', '#693D3 ', '#46211A', '#A43820'],
        "tag": ['우디한', '성숙한', '고요한', '따뜻한', '고급스러운', '중성의', '조용한', '자연주의', '차분한', '클래식한', '평화로운', '편안한']
    },
    4: {
        "hex": ['#598234', '#AEBD38', '#68829E', '#505160'],
        "tag": ['시원한', '스포티한', '대조적인', '건강한', '자연주의', '편안한', '액티브한(활기찬)']
    },
    5: {
        "hex": ['#66A5AD', '#07575B', '#003B46', '#C4DFE6'],
        "tag": ['무게감있는', '맑은', '깨끗한', '건강한', '깔끔한', '심플한', '스포티한', '시크한', '시원한', '자연주의', '짙은', '차분한', '차가운', '편안한', '평화로운']
    },
    6: {
        "hex": ['#2E4600', '#7D4427', '#A2C523', '#486B00'],
        "tag": ['대조적인', '고요한', '복잡한', '건강한', '스포티한', '싱그러운', '우디한', '자연주의', '풍요로운', '평화로운', '깨끗한']
    },
    7: {
        "hex": ['#021C1E', '#004445', '#2C7873', '#6FB98F'],
        "tag": ['깨끗한', '고요한', '세련된', '건강한', '싱그러운', '심플한', '자연주의', '청량한', '편안한', '깔끔한']
    },
    8: {
        "hex": ['#375E97', '#FB6542', '#FFBB00', '#3F681C'],
        "tag": ['명랑한', '귀여운', '따뜻한', '다채로운', '밝은', '발랄한', '상냥한', '산뜻한', '순수한', '상큼한', '천진난만한', '개구진', '쾌활한', '캐쥬얼한', '환한', '화사한']
    },
    9: {
        "hex": ['#98DBC6', '#F18D9E', '#E6D72A', '#5BC8AC'],
        "tag": ['다정한', '로맨틱한', '달콤한', '발랄한', '상냥한', '산뜻한', '사랑스러운', '순수한', '상큼한', '싱그러운', '천진난만한', '환한', '화사한']
    },
    10: {
        "hex": ['#34675C', '#86AC41', '#324851', '#7DA3A1'],
        "tag": ['고급스러운', '깨끗한', '깔끔한', '스포티한', '세련된', '중성의', '잔잔한', '차분한', '평화로운', '편안한', '모던한']
    },
    11: {
        "hex": ['#34675C', '#B7B8B6', '#4CB5F5', '#B3C100'],
        "tag": ['심플한', '스포티한', '시원한', '액티브한(활기찬)', '쾌활한', '투명한', '건강한', '깨끗한', '스포티한', '청량한']
    },
    12: {
        "hex": ['#F4CC70', '#6AB187', '#20948B', '#DE7A22'],
        "tag": ['모던한', '이국적인', '차분한', '따뜻한', '시원한', '신비로운', '조용한', '평화로운', '편안한', '풍요로운', '고급스러운', '부드러운', '세련된', '대조적인']
    },
    13: {
        "hex": ['#F1F1F2', '#1995AD', '#A1D6E2', '#BCBABE'],
        "tag": ['성숙한', '고요한', '따뜻한', '수수한', '신뢰감있는', '우디한', '우아한', '중후한', '차분한', '풍요로운', '편안한']
    },
    14: {
        "hex": ['#A1D6E2', '#BCBABE', '#F1F1F2', '#1995AD'],
        "tag": ['깨끗한', '깔끔한', '건강한', '시원한', '차가운', '밝은', '청량한', '청초한', '투명한', '편안한', '산뜻한', '싱그러운', '맑은']
    },
    15: {
        "hex": ['#DFE166', '#EC96A4', '#5D535E', '#9A9EAB'],
        "tag": ['건강한', '사랑스러운', '사랑스러운', '상큼한', '선한', '청량한', '싱그러운', '부드러운', '캐쥬얼한', '순수한', '자연주의', '편안한']
    },
    16: {
        "hex": ['#F0810F', '#063852', '#011A27', '#E6DF44'],
        "tag": ['모던한', '빈티지한', '세련된', '강렬한', '대조적인', '캐쥬얼한', '풍요로운']
    },
    17: {
        "hex": ['#ACD0C0', '#4F6457', '#D9B44A', '#75B1A9'],
        "tag": ['고급스러운', '고요한', '부드러운', '성숙한', '차분한', '빈티지한', '단아한', '모던한', '선한', '수수한', '세련된', '잔잔한', '자연주의', '조용한', '차분한', '클래식한', '풍요로운', '편안한', '평화로운']
    },
    18: {
        "hex": ['#4B7447', '#F9DC24', '#EB8A44', '#8EBA43'],
        "tag": ['산뜻한', '건강한', '싱그러운', '상큼한', '깨끗한', '명랑한', '액티브한(활기찬)', '화사한', '쾌활한', '자연주의', '상큼한']
    },

    20: {
        "hex": ['#9BC01C', '#FFD64D', '#FA6775', '#F52549'],
        "tag": ['따뜻한', '다채로운', '다정한', '개구진', '발랄한', '밝은', '명랑한', '상냥한', '사랑스러운', '화사한', '상큼한', '달콤한', '유쾌한', '액티브한(활기찬)', '화려한', '환한', '쾌활한', '자유분방한', '산뜻한', '상큼한']
    },
    21: {
        "hex": ['#2E2300', '#6E6702', '#C05805', '#DB9501'],
        "tag": ['우디한', '자연주의', '따뜻한', '수수한', '풍요로운', '클래식한', '편안한', '성숙한', '부드러운', '단정한', '무게감있는', '신뢰감있는', '중후한', '짙은', '차분한']
    },
    22: {
        "hex": ['#E4EA8C', '#CB0000', '#50312F', '#3F6C45'],
        "tag": ['성숙한', '매혹적인', '다채로운', '대조적인', '차분한', '빈티지한', '강렬한', '풍요로운', '세련된', '클래식한', '퇴폐적인']
    },
    23: {
        "hex": ['#F5E356', '#7CAA2D', '#4D85BD', '#CB6318'],
        "tag": ['이국적인', '선한', '따뜻한', '순수한', '밝은', '자연주의', '청초한', '다정한', '캐쥬얼한', '편안한', '평화로운', '환한']
    },
    24: {
        "hex": ['#C6D166', '#5C821A', '#FFFFFF', '#0F1B07'],
        "tag": ['대조적인', '깔끔한', '깨끗한', '모던한', '심플한', '신뢰감있는', '자연주의', '지적인', '세련된', '잔잔한']
    },
    25: {
        "hex": ['#F62A00', '#F1F3CE', '#1E656D', '#00293C'],
        "tag": ['강렬한', '빈티지한', '클래식한', '모던한', '다채로운', '복잡한', '신비로운', '짙은', '화사한']
    },
    26: {
        "hex": ['#B38867', '#DDBC95', '#CDCDC0', '#626D71'],
        "tag": ['잔잔한', '부드러운', '우아한', '중성의', '지적인', '고요한', '고급스러운', '깔끔한', '단아한', '모던한', '심플한', '신뢰감있는', '수수한', '세련된', '조용한', '차분한', '클래식한', '편안한', '평화로운']
    },
    27: {
        "hex": ['#CF3721', '#31A9B8', '#F5BE41', '#258039'],
        "tag": ['쾌활한', '세련된', '싱그러운', '명랑한', '건강한', '다채로운', '캐쥬얼한', '자유분방한', '자연주의', '대조적인', '환한', '화사한', '화려한']
    },
    28: {
        "hex": ['#739F3D', '#FCFDFE', '#F69454', '#EE693F'],
        "tag": ['청초한', '개구진', '액티브한(활기찬)', '건강한', '산뜻한', '순수한', '싱그러운', '상큼한', '천진난만한', '모던한', '맑은', '따뜻한', '다정한', '자연주의', '청량한', '화사한', '환한']
    },
    29: {
        "hex": ['#EB5E30', '#FBCB7B', '#752A07', '#5C8F22'],
        "tag": ['따뜻한', '빈티지한', '순수한', '명랑한', '모던한', '상냥한', '자연주의', '캐쥬얼한']
    },
    30: {
        "hex": ['#D0E1F9', '#4D648D', '#283655', '#1E1F26'],
        "tag": ['전문적인', '깔끔한', '굳센', '고급스러운', '모던한', '심플한', '무게감있는', '몽환적인', '총명한', '시원한', '세련된', '성숙한', '시크한', '신뢰감있는', '중후한', '날카로운', '자연주의', '지적인', '짙은', '깨끗한', '차분한', '고요한', '신뢰감있는']
    },
    31: {
        "hex": ['#F9A603', '#F25C00', '#F7EFE2', '#F70025'],
        "tag": ['귀여운', '건강한', '깔끔한', '상큼한', '화사한', '산뜻한', '다채로운', '따뜻한', '액티브한(활기찬)', '쾌활한', '청량한', '캐쥬얼한', '자유분방한', '정열적인', '싱그러운', '천진난만한']
    },
    32: {
        "hex": ['#ED5752', '#92AAC7', '#E2DFA2', '#A1BE95'],
        "tag": ['다정한', '고요한', '건강한', '로맨틱한', '달콤한', '부드러운', '밝은', '산뜻한', '상냥한', '차분한', '사랑스러운', '선한', '상큼한', '시원한', '청량한', '싱그러운', '청초한', '환한']
    },
    33: {
        "hex": ['#F8A055', '#FA6E59', '#FFDB5C', '#4897D8'],
        "tag": ['다채로운', '귀여운', '다정한', '달콤한', '로맨틱한', '명랑한', '맑은', '밝은', '발랄한', '상냥한', '순수한', '사랑스러운', '상큼한', '개구진', '천진난만한', '환한', '화사한']
    },
    34: {
        "hex": ['#C9A66B', '#EBDCB2', '#662E1C', '#AF4425'],
        "tag": ['전문적인', '중성의', '지적인', '자연주의', '고급스러운', '조용한', '단아한', '중성의', '풍요로운']
    },
    35: {
        "hex": ['#FDD475', '#FFEB94', '#FFCCAC', '#C1E1DC'],
        "tag": ['다정한', '선한', '로맨틱한', '산뜻한', '청량한', '청초한', '순수한', '달콤한', '투명한', '환한', '심플한', '평화로운']
    },

    38: {
        "hex": ['#A11F0C', '#E73F0B', '#BBCF4A', '#F4EC6A'],
        "tag": ['개구진', '순수한', '싱그러운', '상큼한', '다채로운', '자연주의', '천진난만한', '캐쥬얼한', '산뜻한', '화려한', '건강한', '깨끗한', '발랄한']
    },
    39: {
        "hex": ['#805A3B', '#C60000', '#FD974F', '#FEF2E4'],
        "tag": ['수수한', '따뜻한', '성숙한', '정열적인', '풍요로운']
    },
    40: {
        "hex": ['#231B12', '#F56C57', '#B8D20B', '#F77604'],
        "tag": ['모던한', '복잡한', '강렬한', '대조적인', '이국적인', '자유분방한', '액티브한(활기찬)', '유쾌한', '화려한']
    },
    41: {
        "hex": ['#E94F08', '#EDAE01', '#D61800', '#7F152E'],
        "tag": ['짙은', '정열적인', '강렬한', '매혹적인', '성숙한', '풍요로운', '모던한']
    },
    42: {
        "hex": ['#E1B80D', '#867666', '#D5C3AA', '#EAE2D6'],
        "tag": ['우아한', '세련된', '수수한', '지적인', '부드러운', '깔끔한', '잔잔한', '클래식한', '차분한', '자연주의', '심플한', '단아한', '단정한', '캐쥬얼한', '편안한', '평화로운', '모던한', '고요한']
    },
    43: {
        "hex": ['#FDFFFF', '#B3DE81', '#68A225', '#265C00'],
        "tag": ['건강한', '깨끗한', '깔끔한', '투명한', '맑은', '산뜻한', '싱그러운', '편안한', '자연주의', '청량한', '청초한']
    },
    44: {
        "hex": ['#C0B2B5', '#F0EFEA', '#D72C16', '#A10115'],
        "tag": ['따뜻한', '대조적인', '로맨틱한', '매혹적인', '모던한', '성숙한', '세련된', '정열적인', '풍요로운', '화사한', '고급스러운', '세련된']
    },
    45: {
        "hex": ['#E4B600', '#F78B2D', '#7AA802', '#C7DB00'],
        "tag": ['건강한', '싱그러운', '상큼한', '따뜻한', '명랑한', '밝은', '부드러운', '세련된', '순수한', '산뜻한', '자연주의', '청초한', '화사한', '다채로운', '평화로운']
    },
    46: {
        "hex": ['#DDC5A2', '#B6452C', '#523634', '#301B28'],
        "tag": ['굳센', '대조적인', '딱딱한', '다부진', '고급스러운', '퇴폐적인', '클래식한', '시크한', '세련된', '성숙한', '우디한', '중성의', '중후한', '지적인', '짙은', '러프한', '모던한', '매혹적인', '무게감있는', '차분한', '풍요로운', '단정한']
    },
    47: {
        "hex": ['#B38540', '#563E20', '#7E7B15', '#EBDF00'],
        "tag": ['자연주의', '대조적인', '신비로운', '단아한', '우아한', '성숙한', '수수한', '잔잔한', '차분한', '이국적인', '신뢰감있는', '우디한']
    },
    48: {
        "hex": ['#7D5E3C', '#EAD39C', '#B51D0A', '#662225'],
        "tag": ['짙은', '정열적인', '따뜻한', '편안한', '지적인', '이국적인', '성숙한', '빈티지한', '무게감있는']
    },

    50: {
        "hex": ['#F5CA99', '#FCFDFE', '#FE7A47', '#D8412F'],
        "tag": ['깔끔한', '밝은', '발랄한', '건강한', '따뜻한', '다정한', '세련된', '산뜻한', '발랄한', '부드러운', '청초한', '밝은', '화사한', '귀여운', '환한', '상냥한']
    },
    51: {
        "hex": ['#ED8C72', '#F4EADE', '#2F496E', '#2988BC'],
        "tag": ['빈티지한', '모던한', '부드러운', '깨끗한', '깔끔한', '싱그러운', '심플한', '신비로운', '청초한', '평화로운', '화사한']
    },
    52: {
        "hex": ['#EDB83D', '#F8F5F2', '#D70026', '#000B29'],
        "tag": ['구조적인', '무게감있는', '정열적인', '강렬한', '딱딱한', '전문적인', '복잡한', '짙은', '퇴폐적인', '화려한', '대조적인']
    },
    53: {
        "hex": ['#BC6D4F', '#9D331F', '#500805', '#1E0000'],
        "tag": ['우디한', '고급스러운', '강렬한', '다부진', '딱딱한', '러프한', '무게감있는', '중후한', '지적인', '짙은', '전문적인', '중성의', '조용한', '차분한', '차가운', '클래식한', '편안한']
    },

    55: {
        "hex": ['#C9D1C8', '#5B7065', '#3040404', '#04202C'],
        "tag": ['대조적인', '딱딱한', '다부진', '고요한', '구조적인', '깔끔한', '굳센', '고급스러운', '시크한', '신뢰감있는', '세련된', '성숙한', '복잡한', '모던한', '중후한', '지적인', '짙은', '중성의', '전문적인', '차가운', '차분한', '총명한', '편안한', '평화로운', '날카로운']
    },
    56: {
        "hex": ['#785A46', '#EBB582', '#EB8A3E', '#D24136'],
        "tag": ['다정한', '따뜻한', '다채로운', '강렬한', '밝은', '발랄한', '산뜻한', '상냥한', '부드러운', '이국적인']
    },

    58: {
        "hex": ['#B9C4C9', '#52958B', '#128277', '#004D47'],
        "tag": ['시원한', '건강한', '투명한', '깨끗한', '자연주의', '굳센', '모던한', '맑은', '심플한', '신비로운', '차가운', '시원한', '중성의', '지적인', '잔잔한', '평화로운', '총명한', '청량한', '차분한', '깔끔한']
    },
    59: {
        "hex": ['#7D5642', '#F3EBDD', '#2A2922', '#506D2F'],
        "tag": ['모던한', '무게감있는', '깔끔한', '구조적인', '깨끗한', '고급스러운', '대조적인', '무게감있는', '딱딱한', '빈티지한', '복잡한', '신뢰감있는', '우디한', '중성의', '지적인', '자연주의', '클래식한', '풍요로운', '편안한']
    },
    60: {
        "hex": ['#008DCB', '#FFEC5C', '#E1315B', '#F47D4AA'],
        "tag": ['개구진', '다채로운', '달콤한', '로맨틱한', '산뜻한', '상큼한', '천진난만한', '쾌활한', '환한', '화사한']
    },
    61: {
        "hex": ["#ACBD78", "#B2473E", "#EAB364", "#A4CABC",],
        "tag": ['이국적인', '빈티지한', '부드러운', '차분한', '편안한', '평화로운', '따뜻한', '수수한']
    },
    62: {
        "hex": ['#CD7213', '#EFB509', '#002C54', '#16253D'],
        "tag": ['대조적인', '딱딱한', '고급스러운', '모던한', '러프한', '무게감있는', '빈티지한', '복잡한', '시크한', '이국적인', '전문적인', '중성의', '화려한', '총명한', '세련된', '화려한', '스포티한']
    },
    63: {
        "hex": ['#DDA288', '#7E675E', '#5A4E4D', '#8593AE'],
        "tag": ['지적인', '클래식한', '고요한', '차가운', '부드러운', '세련된', '시크한', '심플한', '편안한']
    },

    65: {
        "hex": ['#020509', '#FFCE38', '#FF0038', '#00CFFA'],
        "tag": ['화려한', '차가운', '깨끗한', '대조적인', '무게감있는', '강렬한', '딱딱한', '복잡한', '정열적인', '퇴폐적인     ']
    },
    66: {
        "hex": ['#A99F3C', '#E59D5C', '#F3D3B8', '#A5C3CF'],
        "tag": ['선한', '상큼한', '수수한', '따뜻한', '부드러운', '상냥한', '밝은', '부드러운', '밝은', '싱그러운', '청초한', '청량한', '순수한', '환한', '깨끗한', '평화로운']
    },
    67: {
        "hex": ['#FF4447', '#FFFFFF', '#5EA8A7', '#257985'],
        "tag": ['심플한', '모던한', '깔끔한', '강렬한', '싱그러운', '세련된', '시원한', '이국적인', '유쾌한', '쾌활한', '풍요로운', '캐쥬얼한', '화려한', '액티브한(활기찬)', '환한', '건강한', '명랑한', '쾌활한']
    },
    68: {
        "hex": ['#FF4447', '#FFFFFF', '#5EA8A7', '#257985'],
        "tag": ['고요한', '귀여운', '로맨틱한', '다정한', '단정한', '부드러운', '상냥한', '산뜻한', '순수한', '빈티지한', '선한', '신뢰감있는', '수수한', '잔잔한', '사랑스러운', '따뜻한']
    },
    69: {
        "hex": ['#2D3033l', '#AA4B41', '#D4DDE1', '#335252'],
        "tag": ['날카로운', '고급스러운', '무게감있는', '모던한', '조용한', '잔잔한', '전문적인', '중성의', '중후한', '지적인', '짙은', '굳센', '딱딱한', '클래식한', '편안한']
    },
    70: {
        "hex": ['#E2E8E4', '#006C84', '#6EB5C0', '#FFCCBB'],
        "tag": ['깨끗한', '깔끔한', '고요한', '로맨틱한', '청량한', '몽환적인', '밝은', '산뜻한', '심플한', '순수한', '싱그러운', '시원한', '싱그러운', '차가운', '청초한', '환한']
    },
    71: {
        "hex": ['#E2C499', '#E8A735', '#C8000A', '#8C0004'],
        "tag": ['이국적인', '따뜻한', '강렬한', '짙은', '액티브한(활기찬)', '빈티지한', '다채로운', '중성의']
    },
    72: {
        "hex": ['#F4EBDB', '#8E9B97', '#537072', '#2C4A52'],
        "tag": ['다부진', '몽환적인', '모던한', '딱딱한', '고요한', '구조적인', '굳센', '날카로운', '무게감있는', '모던한', '몽환적인', '복잡한', '시크한', '신뢰감있는', '중성의', '잔잔한', '전문적인', '차분한', '편안한']
    },
    73: {
        "hex": ['#C5BEBA', '#113743', '#E4E3DB', '#C5001A'],
        "tag": ['캐쥬얼한', '대조적인', '딱딱한', '날카로운', '스포티한', '굳센', '차가운', '강렬한', '신뢰감있는', '구조적인', '총명한', '모던한']
    },

    75: {
        "hex": ['#5A5F37', '#FFFAE1', '#524A3A', '#919636'],
        "tag": ['시크한', '건강한', '대조적인', '모던한', '중성의', '차분한', '평화로운', '굳센', '러프한  ']
    },
    76: {
        "hex": ['#E7472E', '#432E33', '#E5E2CA', '#B1D7D2'],
        "tag": ['날카로운', '구조적인', '강렬한', '대조적인', '러프한', '무게감있는', '매혹적인', '빈티지한', '복잡한', '성숙한', '스포티한', '시크한']
    },
    77: {
        "hex": ['#3A5199', '#FFFFFF', '#D5D6D2', '#2F2E33'],
        "tag": ['구조적인', '깔끔한', '굳센', '딱딱한', '모던한', '시크한', '신뢰감있는', '날카로운', '신뢰감있는', '시원한', '전문적인', '중성의', '차가운', '총명한']
    },
    78: {
        "hex": ['#FF8D3F', '#353C3F', '#D5D6D2', '#756867'],
        "tag": ['고급스러운', '모던한', '무게감있는', '풍요로운', '대조적인', '다부진', '빈티지한', '무게감있는', '신비로운', '성숙한', '시크한', '신뢰감있는', '세련된', '이국적인', '전문적인', '클래식한']
    },
    79: {
        "hex": ['#2F2F28', '#F0EFFE', '#AF1C1C', '#31A2AC'],
        "tag": ['고급스러운', '강렬한', '구조적인', '짙은', '자유분방한', '중성의', '성숙한', '액티브한(활기찬)']
    },
    80: {
        "hex": ['#4F4A45', '#DAC3B3', '#CDAB81', '#6C5F5B'],
        "tag": ['러프한', '단정한', '우디한', '빈티지한', '부드러운', '모던한', '무게감있는', '수수한', '우아한', '차분한', '클래식한', '편안한']
    },
    81: {
        "hex": ['#E1B16A', '#78A5A3', '#CE5A57', '#444C5C'],
        "tag": ['대조적인', '부드러운', '이국적인', '차분한', '캐쥬얼한', '수수한', '다채로운']
    },
    82: {
        "hex": ['#A01D26', '#F4F4EF', '#ACBEBE', '#20232A'],
        "tag": ['대조적인', '딱딱한', '고급스러운', '다부진', '러프한', '날카로운', '무게감있는', '모던한', '시크한', '전문적인', '중성의', '지적인', '총명한', '차가운', '차분한']
    },

    85: {
        "hex": ['#594D46', '#D1B280', '#EFEFEF', '#080706'],
        "tag": ['딱딱한', '깔끔한', '고급스러운', '굳센', '신뢰감있는', '전문적인', '지적인', '조용한', '클래식한', '총명한', '차분한', '편안한', '날카로운', '무게감있는']
    },
    86: {
        "hex": ['#D5C9B1', '#E05858', '#BFDCCF', '#5F968E'],
        "tag": ['깔끔한', '로맨틱한', '달콤한', '스포티한', '심플한', '청초한', '다채로운', '캐쥬얼한']
    },

    88: {
        "hex": ['#5E8EFD', '#FAEFD4', '#A0B084', '#688B8A'],
        "tag": ['귀여운', '깨끗한', '깔끔한', '명랑한', '모던한', '맑은', '밝은', '산뜻한', '심플한', '모던한', '시원한', '청초한', '차가운', '청량한', '투명한', '평화로운']
    },
    89: {
        "hex": ['#615049', '#F1D3BC', '#F34A4A', '#262F34'],
        "tag": ['퇴폐적인', '세련된', '화려한', '대조적인', '매혹적인', '모던한', '날카로운']
    },
    90: {
        "hex": ['#C29545', '#323030', '#CDBEA7', '#882426'],
        "tag": ['퇴폐적인', '딱딱한', '러프한', '모던한', '무게감있는', '날카로운', '빈티지한', '이국적인', '클래식한', '매혹적인', '시크한', '풍요로운']
    },

    92: {
        "hex": ['#88A550', '#282623', '#A3A599', '#FBCD4B'],
        "tag": ['날카로운', '딱딱한', '대조적인', '성숙한', '신뢰감있는', '자연주의', '전문적인', '편안한', '고요한', '모던한', '지적인', '구조적인']
    },
    93: {
        "hex": ['#1A405F', '#337BAE', '#FCFCFA', '#FFBEBD'],
        "tag": ['깔끔한', '순수한', '쾌활한', '부드러운', '깨끗한', '다정한', '시원한', '심플한', '캐쥬얼한']
    },
    94: {
        "hex": ['#1B4B5A', '#F55449', '#8E7970', '#0F1F38'],
        "tag": ['딱딱한', '날카로운', '고급스러운', '강렬한', '구조적인', '대조적인', '몽환적인', '퇴폐적인', '무게감있는', '스포티한', '딱딱한', '짙은', '정열적인', '굳센', '러프한', '자유분방한']
    },

    98: {
        "hex": ['#67BACA', '#FDF6F6', '#FE0000', '#B3DBC0'],
        "tag": ['이국적인', '유쾌한', '개구진', '정열적인', '빈티지한', '밝은', '발랄한', '다채로운', '명랑한', '매혹적인', '시원한', '자유분방한', '화사한', '화려한']
    }
}