export const keywordArr = ['고급스러운', '개구진', '굳센', '귀여운', '깨끗한', '깔끔한', '강렬한', '고요한', '건강한', '구조적인', '날카로운'
    , '대조적인', '딱딱한', '달콤한', '따뜻한', '다채로운', '단아한', '다정한', '단정한', '다부진', '로맨틱한', '러프한', '몽환적인', '맑은', '무게감있는', '명랑한', '모던한'
    , '매혹적인', '복잡한', '빈티지한', '부드러운', '밝은', '발랄한', '상냥한', '성숙한', '신비로운', '산뜻한', '심플한', '순수한', '사랑스러운', '스포티한', '선한', '시크한'
    , '신뢰감있는', '싱그러운', '수수한', '세련된', '상큼한', '시원한', '우아한', '이국적인', '유쾌한', '우디한', '잔잔한', '중후한', '전문적인', '중성의', '지적인', '짙은'
    , '자유분방한', '자연스러운', '조용한', '정열적인', '차가운', '총명한', '청량한', '차분한', '천진난만한', '청초한', '클래식한', '쾌활한', '캐쥬얼한', '투명한', '퇴폐적인'
    , '풍요로운', '편안한', '평화로운', '환한', '화사한', '화려한', '활기찬']


export const imageTagArr =
{
    "image0000.jpg": [
        "퇴폐적인"
        , "무게감있는"
        , "성숙한"
        , "자유분방한"
        , "매혹적인"
        , "몽환적인"
    ]
    ,
    "image0001.jpg": [
        "몽환적인"
        , "신비로운"
        , "중성의"
        , "차가운"
        , "짙은"
        , "강렬한"
    ]
    ,
    "image0002.jpg": [
        "깔끔한"
        , "부드러운"
        , "전문적인"
        , "평화로운"
        , "클래식한"
    ]
    ,
    "image0003.jpg": [
        "차가운"
        , "퇴폐적인"
        , "짙은"
        , "성숙한"
        , "몽환적인"
        , "매혹적인"
        , "강렬한"
    ]
    ,
    "image0004.jpg": [
        "자유분방한"
        , "평화로운"
        , "풍요로운"
    ]
    ,
    "image0005.jpg": [
        "평화로운"
        , "활기찬"
        , "잔잔한"
        , "풍요로운"
    ]
    ,
    "image0006.jpg": [
        "퇴폐적인"
        , "강렬한"
    ]
    ,
    "image0007.jpg": [
        "부드러운"
        , "캐쥬얼한"
        , "밝은"
        , "모던한"
        , "화려한"
    ]
    ,
    "image0008.jpg": [
        "심플한"
        , "캐쥬얼한"
        , "부드러운"
        , "밝은"
        , "모던한"
    ]
    ,
    "image0009.jpg": [
        "깔끔한"
        , "달콤한"
        , "깨끗한"
        , "구조적인"
        , "사랑스러운"
        , "밝은"
    ]
    ,
    "image0010.jpg": [
        "따뜻한"
        , "모던한"
        , "단아한"
        , "밝은"
        , "구조적인"
        , "부드러운"
    ]
    ,
    "image0011.jpg": [
        "화려한"
        , "다채로운"
        , "편안한"
        , "깔끔한"
        , "부드러운"
        , "구조적인"
        , "밝은"
        , "모던한"
    ]
    ,
    "image0012.jpg": [
        "세련된"
    ]
    ,
    "image0013.jpg": [
        "깔끔한"
        , "단아한"
        , "우디한"
        , "모던한"
        , "심플한"
        , "깨끗한"
        , "밝은"
        , "환한"
        , "편안한"
        , "캐쥬얼한"
        , "조용한"
    ]
}

export const imageInfo = importAllImage(require.context(process.env.PUBLIC_URL + '../asset', false, /\.(png|jpe?g|svg)$/))

function importAllImage(r) {
    let images = {};
    r.keys().map((item, index) => {
        images[item.replace('./', '')] = { "path": r(item), "isSelected": false, "tag": imageTagArr[item.replace('./', '')] }
    });
    return images;
}

export const keywordInfo = importAllKeyword()

function importAllKeyword() {
    let keywords = {};
    keywordArr.map((keyword, index) => {
        keywords[keyword] = { "name": keyword, "isSelected": false }
    })
    return keywords;
}


export const fontInfo = {
    'Anton': ['구조적인','무게감있는','강렬한','건강한','다부진'],
    'Kanit': ['사랑스러운','귀여운'], 
    'Roboto Slab': ['시크한','전문적인','따뜻한'],
    'Rubik':['투명한','부드러운','깨끗한','사랑스러운','환한','상큼한'],
    'Fascinate':['대조적인','캐쥬얼한','화려한','모던한','고급스러운'],
    'Shadows Into Light' : ['다채로운','발랄한','캐쥬얼한','자유분방한','빈티지한','쾌활한','활기찬','명랑한'],
    'Bebas Neue' : ['쾌활한','차가운','활기찬','짙은','스포티한','중성의'],
    'Lobster':['부드러운','캐쥬얼한','자연주의'],
    'Tiro Kannada':['세련된','로맨틱한','신뢰감있는','모던한'],
    'Blaka':['다부진','복잡한','강렬한','딱딱한']
};
