export const keywordArr = ['고급스러운', '개구진', '굳센', '귀여운', '깨끗한', '깔끔한', '강렬한', '고요한', '건강한', '구조적인', '날카로운'
    , '대조적인', '딱딱한', '달콤한', '따뜻한', '다채로운', '단아한', '다정한', '단정한', '다부진', '로맨틱한', '러프한', '몽환적인', '맑은', '무게감있는', '명랑한', '모던한'
    , '매혹적인', '복잡한', '빈티지한', '부드러운', '밝은', '발랄한', '상냥한', '성숙한', '신비로운', '산뜻한', '심플한', '순수한', '사랑스러운', '스포티한', '선한', '시크한'
    , '신뢰감있는', '싱그러운', '수수한', '세련된', '상큼한', '시원한', '우아한', '이국적인', '유쾌한', '우디한', '잔잔한', '중후한', '전문적인', '중성의', '지적인', '짙은'
    , '자유분방한', '자연스러운', '조용한', '정열적인', '차가운', '총명한', '청량한', '차분한', '천진난만한', '청초한', '클래식한', '쾌활한', '캐쥬얼한', '투명한', '퇴폐적인'
    , '풍요로운', '편안한', '평화로운', '환한', '화사한', '화려한', '활기찬']


export const imageTagArr =
{
    "image0000.jpg": ["퇴폐적인", "무게감있는", "성숙한", "자유분방한", "매혹적인", "몽환적인"],
    "image0001.jpg": ["몽환적인", "신비로운", "중성의", "차가운", "짙은", "강렬한"],
    "image0002.jpg": ["깔끔한", "부드러운", "전문적인", "평화로운", "클래식한"],
    "image0003.jpg": ["차가운", "퇴폐적인", "짙은", "성숙한", "몽환적인", "매혹적인", "강렬한"],
    "image0004.jpg": ["자유분방한", "평화로운", "풍요로운"],
    "image0005.jpg": ["평화로운", "활기찬", "잔잔한", "풍요로운"],
    "image0006.jpg": ["퇴폐적인", "강렬한"],
    "image0007.jpg": ["부드러운", "캐쥬얼한", "밝은", "모던한", "화려한"],
    "image0008.jpg": ["심플한", "캐쥬얼한", "부드러운", "밝은", "모던한"],
    "image0009.jpg": ["깔끔한", "달콤한", "깨끗한", "구조적인", "사랑스러운", "밝은"],
    "image0010.jpg": ["따뜻한", "모던한", "단아한", "밝은", "구조적인", "부드러운"],
    "image0011.jpg": ["화려한", "다채로운", "편안한", "깔끔한", "부드러운", "구조적인", "밝은", "모던한"],
    "image0012.jpg": ["세련된"],
    "image0013.jpg": ["깔끔한", "단아한", "우디한", "모던한", "심플한", "깨끗한", "밝은", "환한", "편안한", "캐쥬얼한", "조용한"],
    'image0014.jpg': ['따뜻한','부드러운','우디한','잔잔한','조용한','차분한'],
    'image0015.jpg': ['귀여운','다정한','사랑스러운','천진난만한','평화로운'],
    'image0016.jpg': ['빈티지한','캐쥬얼한','따뜻한','러프한'],
    'image0017.jpg': ['스포티한','클래식한','고급스러운','부드러운','빈티지한'],
    'image0018.jpg': ['귀여운','개구진','다채로운','명랑한','발랄한','천진난만한','쾌활한','화려한','활기찬'],
    'image0019.jpg': ['빈티지한','밝은','캐쥬얼한','청량한','발랄한'],
    'image0020.jpg': ['이국적인','환한','우디한','캐쥬얼한','우아한','깔끔한','세련된','모던한','고급스러운','밝은'],
    'image0021.jpg': ['중후한','짙은','차가운','강렬한','무게감있는','대조적인','모던한'],
    'image0022.jpg': ['대조적인','부드러운','고요한','잔잔한','짙은','조용한'],
    'image0023.jpg': ['순수한','사랑스러운','천진난만한','선한','평화로운','개구진','귀여운','발랄한'],
    'image0024.jpg': ['평화로운','자연스러운','고요한','따뜻한','신비로운'],
    'image0025.jpg': ['따뜻한','부드러운'],
    'image0026.jpg': ['귀여운','모던한','빈티지한'],
    'image0027.jpg': ['이국적인','고요한','따뜻한','청량한','맑은','평화로운','밝은','환한','산뜻한'],
    'image0028.jpg': ['고급스러운','클래식한','화려한','모던한'],
    'image0029.jpg': ['부드러운','빈티지한','우디한'],
    'image0030.jpg': ['매혹적인','풍요로운','우아한','따뜻한','밝은','화사한','로맨틱한'],
    'image0031.jpg': ['잔잔한','환한','시원한'],
    'image0032.jpg': ['구조적인','깔끔한','정열적인','강렬한','전문적인','스포티한','무게감있는','짙은','고급스러운','매혹적인'],
    'image0033.jpg': ['개구진','귀여운','명랑한','유쾌한','천진난만한'],
    'image0034.jpg': ['러프한','평화로운','차분한','잔잔한','스포티한'],
    'image0035.jpg': ['몽환적인','화사한','밝은','풍요로운','화사한','중성의'],
    'image0036.jpg': ['고요한','따뜻한','화사한','이국적인'],
    'image0037.jpg': ['차가운','잔잔한','차분한','복잡한','짙은'],
    'image0038.jpg': ['퇴폐적인','정열적인','화려한','몽환적인','매혹적인','다채로운','강렬한'],
    'image0039.jpg': ['퇴폐적인','고급스러운','화려한','성숙한','몽환적인','신비로운','매혹적인','강렬한'],
    'image0040.jpg': ['강렬한','성숙한','다채로운','신비로운','몽환적인','화려한','매혹적인'],
    'image0041.jpg': ['이국적인','고요한','빈티지한','자연스러운'],
    'image0042.jpg': ['차분한','조용한','이국적인','고요한','잔잔한'],
    'image0043.jpg': ['이국적인','우디한','자연주의','조용한'],
    'image0044.jpg': ['러프한','잔잔한','짙은','차가운','차분한'],
    'image0045.jpg': ['구조적인','고급스러운','모던한','대조적인','세련된','복잡한'],
    'image0046.jpg': ['딱딱한','고급스러운','모던한','딱딱한','구조적인','대조적인','복잡한','화려한'],
    'image0047.jpg': ['빈티지한','편안한','차분한','평화로운'],
    'image0048.jpg': ['산뜻한','싱그러운','수수한','청초한'],
    'image0049.jpg': ['구조적인','짙은','복잡한','차가운','딱딱한','무게감있는','중후한'],
    'image0050.jpg': ['강렬한','몽환적인','강렬한'],
    'image0051.jpg': ['로맨틱한','이국적인','풍요로운','환한','화려한'],
    'image0052.jpg': ['맑은','시원한','산뜻한'],
    'image0053.jpg': ['깔끔한','모던한','심플한','전문적인'],
    'image0054.jpg': ['활기찬','러프한'],
    'image0055.jpg': ['빈티지한','부드러운','짙은','조용한','평화로운'],
    'image0056.jpg': ['고요한','차분한','화려한','환한'],
    'image0057.jpg': ['부드러운','짙은','구조적인','중후한','클래식한','단아한','신비로운'],
    'image0058.jpg': ['활기찬','빈티지한','러프한','강렬한','자유분방한','다채로운','복잡한','대조적인','화려한','퇴폐적인'],
    'image0059.jpg': ['몽환적인','맑은','환한','싱그러운','평화로운'],
    'image0060.jpg': ['평화로운','풍요로운','고요한','신비로운'],
    'image0061.jpg': ['몽환적인','강렬한','화려한','대조적인'],
    'image0062.jpg': ['환한','따뜻한','밝은','깨끗한','평화로운'],
    'image0063.jpg': ['이국적인','환한','심플한'],
    'image0064.jpg': ['고급스러운','산뜻한','풍요로운','로맨틱한'],
    'image0065.jpg': ['이국적인','짙은','고요한'],
    'image0066.jpg': ['빈티지한','딱딱한','러프한','클래식한'],
    'image0067.jpg': ['성숙한','무게감있는','굳센','다부진','성숙한','굳센','시크한','강렬한','중후한','러프한','짙은'],
    'image0068.jpg': ['화려한','고급스러운','모던한','다채로운'],
    'image0069.jpg': ['환한','구조적인','투명한','모던한','청량한','심플한','시원한','깔끔한'],
    'image0070.jpg': ['몽환적인','부드러운','대조적인','자유분방한','활기찬','다채로운','러프한'],
    'image0071.jpg': ['사랑스러운','로맨틱한','밝은','산뜻한','부드러운'],
    'image0072.jpg': ['조용한','차가운','러프한','차가운'],
    'image0073.jpg': ['몽환적인','신비로운'],
    'image0074.jpg': ['쾌활한','발랄한','유쾌한','명랑한','천진난만한'],
    'image0075.jpg': ['빈티지한','퇴폐적인','러프한','짙은','무게감있는','몽환적인','성숙한','시크한'],
    'image0076.jpg': ['우디한','전문적인','지적인','클래식한'],
    'image0077.jpg': ['달콤한','산뜻한','발랄한','상큼한','화사한'],
    'image0078.jpg': ['무게감있는','차가운','복잡한','날카로운','딱딱한','깔끔한'],
    'image0079.jpg': ['딱딱한','모던한','화사한','캐쥬얼한','따뜻한','활기찬','밝은','산뜻한'],
    'image0080.jpg': ['짙은','몽환적인','차가운','퇴폐적인','중성의','무게감있는','성숙한'],
    'image0081.jpg': ['클래식한','이국적인','우디한','다채로운','고급스러운','화려한','풍요로운','우아한'],
    'image0082.jpg': ['따뜻한','성숙한','청초한','수수한'],
    'image0083.jpg': ['우디한','자연스러운'],
    'image0084.jpg': ['귀여운','싱그러운','단정한','천진난만한','밝은','쾌활한','발랄한','상냥한','순수한'],
    'image0085.jpg': ['빈티지한','몽환적인'],
    'image0086.jpg': ['따뜻한','환한','조용한'],
    'image0087.jpg': ['성숙한','중성의','수수한','중성의','몽환적인','매혹적인'],
    'image0088.jpg': ['산뜻한','평화로운','화사한','환한','잔잔한','상큼한'],
    'image0089.jpg': ['부드러운','자유분방한'],
    'image0090.jpg': ['로맨틱한','화사한','청초한','단아한'],
    'image0091.jpg': ['청초한','수수한','단아한'],
    'image0092.jpg': ['성숙한','몽환적인','매혹적인','신비로운','우아한'],
    'image0093.jpg': ['성숙한','퇴폐적인','매혹적인','신비로운','몽환적인'],
    'image0094.jpg': ['싱그러운','시원한','건강한','청량한'],
    'image0095.jpg': ['캐쥬얼한','차가운','시원한'],
    'image0096.jpg': ['몽환적인','차분한','고요한','잔잔한','평화로운'],
    'image0097.jpg': ['사랑스러운','로맨틱한','상냥한','달콤한'],
    'image0098.jpg': ['맑은','신비로운','빈티지한','투명한','몽환적인'],
    'image0099.jpg': ['고요한','투명한','차분한','부드러운'],
    'image0100.jpg': ['청량한','맑은','싱그러운'],
    "image0101.jpg": ['맑은','부드러운','조용한','평화로운','차가운','투명한','고요한'],
    "image0102.jpg": ['부드러운','빈티지한','이국적인','클래식한'],
    "image0103.jpg": ['차가운','조용한','모던한','무게감있는'],
    "image0104.jpg": ['대조적인','딱딱한','무게감있는','클래식한','잔잔한','중후한'],
    "image0105.jpg": ['활기찬','쾌활한','강렬한','복잡한','정열적인','자유분방한'],
    "image0106.jpg": ['사랑스러운','유쾌한','시크한','성숙한'],
    "image0107.jpg": ['사랑스러운','화사한','다정한','우아한'],
    "image0108.jpg": ['대조적인','정열적인','화려한','이국적인','정열적인','무게감있는','퇴폐적인'],
    "image0109.jpg": ['싱그러운','수수한','환한','차분한'],
    "image0110.jpg": ['러프한','퇴폐적인','자유분방한'],
    "image0111.jpg": ['스포티한','신뢰감있는','무게감있는','짙은','고급스러운','다부진','시크한'],
    "image0112.jpg": ['고급스러운','심플한','단정한','모던한','세련된'],
    "image0113.jpg": ['신비로운','다채로운','평화로운'],
    'image0114.jpg': ['개구진','귀여운','발랄한','자연주의','순수한','사랑스러운'],
    'image0115.jpg': ['잔잔한','고요한'],
    'image0116.jpg': ['신비로운','몽환적인','이국적인','우디한','고요한'],
    'image0117.jpg': ['캐쥬얼한','러프한','자유분방한','자연스러운','러프한','시크한','스포티한'],
    'image0118.jpg': ['스포티한','굳센','건강한','다부진','전문적인'],
    'image0119.jpg': ['모던한','다채로운','캐쥬얼한','밝은','대조적인'],
    'image0120.jpg': ['천진난만한','사랑스러운','명랑한','다정한','신뢰감있는','편안한','따뜻한','밝은','순수한','귀여운','상냥한'],
    'image0121.jpg': ['러프한','신비로운','다채로운','부드러운','달콤한'],
    'image0122.jpg': ['구조적인','차가운','시원한','잔잔한','청량한'],
    'image0123.jpg': ['다채로운','구조적인','따뜻한','산뜻한','캐쥬얼한'],
    'image0124.jpg': ['차가운','지적인','전문적인','무게감있는','신뢰감있는','풍요로운'],
    'image0125.jpg': ['자유분방한','구조적인','모던한','활기찬','무게감있는','차가운','대조적인'],
    'image0126.jpg': ['고급스러운','모던한','단정한','세련된','깔끔한'],
    'image0127.jpg': ['전문적인','신뢰감있는','총명한'],
    'image0128.jpg': ['자연주의','빈티지한','밝은','따뜻한','평화로운'],
    'image0129.jpg': ['싱그러운','빈티지한','로맨틱한'],
    'image0130.jpg': ['매혹적인','조용한','고요한','짙은','무게감있는','정열적인'],
    'image0131.jpg': ['따뜻한','다정한','선한','유쾌한','자유분방한','밝은','명랑한','편안한'],
    'image0132.jpg': ['다정한','쾌활한','명랑한','상냥한','밝은'],
    'image0133.jpg': ['스포티한','건강한','활기찬'],
    'image0134.jpg': ['전문적인','지적인','클래식한','신뢰감있는','전문적인'],
    'image0135.jpg': ['구조적인','깔끔한'],
    'image0136.jpg': ['정열적인','활기찬','자유분방한','캐쥬얼한'],
    'image0137.jpg': ['활기찬','자유분방한','쾌활한']
}

export const imageInfo = importAllImage(require.context(process.env.PUBLIC_URL + '../asset', false, /\.(png|jpe?g|svg)$/))

function importAllImage(r) {
    let images = {};
    r.keys().map((item, index) => {
        images[item.replace('./', '')] = { "path": r(item), "isSelected": false, "tag": imageTagArr[item.replace('./', '')] }
    });
    return images;
}

export const keywordInfo = importAllKeyword()

function importAllKeyword() {
    let keywords = {};
    keywordArr.map((keyword, index) => {
        keywords[keyword] = { "name": keyword, "isSelected": false }
    })
    return keywords;
}


export const fontInfo = {
    'Anton': ['구조적인', '무게감있는', '강렬한', '건강한', '다부진'],
    'Kanit': ['사랑스러운', '귀여운'],
    'Roboto Slab': ['시크한', '전문적인', '따뜻한'],
    'Rubik': ['투명한', '부드러운', '깨끗한', '사랑스러운', '환한', '상큼한'],
    'Fascinate': ['대조적인', '캐쥬얼한', '화려한', '모던한', '고급스러운'],
    'Shadows Into Light': ['다채로운', '발랄한', '캐쥬얼한', '자유분방한', '빈티지한', '쾌활한', '활기찬', '명랑한'],
    'Bebas Neue': ['쾌활한', '차가운', '활기찬', '짙은', '스포티한', '중성의'],
    'Lobster': ['부드러운', '캐쥬얼한', '자연주의'],
    'Tiro Kannada': ['세련된', '로맨틱한', '신뢰감있는', '모던한'],
    'Blaka': ['다부진', '복잡한', '강렬한', '딱딱한']
};
